tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# System Utils
brew "coreutils"
brew "trash"
brew "wget"
brew "cowsay"
brew "direnv"

# Utils
# https://tex.stackexchange.com/questions/974/why-is-the-mactex-distribution-so-large-is-there-anything-smaller-for-os-x
brew "pandoc"
cask "basictex"

# Dev
brew "bash"
brew "git"
brew "node"
brew "vim", args: ["with-override-system-vi"]
# Note: both python 2 and 3
# 1) python -> python2; python3 -> python3
# 2) pip -> pip3; pip2 -> pip2
# These dotfiles set aliases to remap python in the shell
# to Python 3 and pip to pip3.

# I think Miniconda comes with python3, so we'll disable this for now
# brew "python"
brew "python@2"

# Apps
cask "google-chrome"
cask "spectacle"
cask "flux"
cask "atom"
cask "iterm2"
cask "spotify"
cask "time-out"
cask "sublime-text"
cask "figma"
cask "slack"
